Revit 2027 API
FlexPipe.FlowState Property
The flow state of the pipe.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public PipeFlowState FlowState { get; }
Public ReadOnly Property FlowState As PipeFlowState
	Get
public:
property PipeFlowState FlowState {
	PipeFlowState get ();
}
member FlowState : PipeFlowState with get
Property Value
PipeFlowState
See Also
Reference
FlexPipe Class
Autodesk.Revit.DB.Plumbing Namespace